Repository: orsinium-labs/pydantic-translations
Catalog: locales/*.po
Languages: ru

source: byte type expected
ru: ожидалась последовательность байт

source: str type expected
ru: ожидалась строка

source: value could not be parsed to a boolean
ru: значение не может быть интерпретировано как логический тип

source: could not parse value and unit from byte string
ru: не получается достать значение и единицу измерения из байтовой строки

source: extra fields not permitted
ru: дополнительные поля не разрешены

source: invalid date format
ru: некорректный формат даты

source: invalid datetime format
ru: некорректный формат даты и времени

source: invalid duration format
ru: некорректный формат продолжительности

source: Invalid JSON
ru: некорректный JSON

source: invalid time format
ru: некорректный формат времени

source: value is not a valid email address
ru: некорректный формат адреса электронной почты

source: value is not a valid IPv4 address
ru: значение должно быть корректным IPv4 адресом

source: value is not a valid IPv4 network
ru: значение должно быть корректной IPv4 сетью

source: value is not a valid IPv4 or IPv6 address
ru: значение должно быть корректным IPv4 или IPv6 адресом

source: value is not a valid IPv4 or IPv6 network
ru: значение должно быть корректной IPv4 или IPv6 сетью

source: value is not a valid IPv6 address
ru: значение должно быть корректным IPv6 адресом

source: value is not a valid IPv6 network
ru: значение должно быть корректной IPv6 сетью

source: instance of {expected_arbitrary_type} expected
ru: значение должно быть логическим типом

source: {value} is not callable
ru: {value} не является вызываемым типом

source: a class is expected
ru: ожидался класс

source: instance of {class_name}, tuple or dict expected
ru: ожидалось значение типа {class_name}, кортеж или словать

source: value is not a valid decimal
ru: значение должно быть десятичным числом

source: value is not a valid deque
ru: значение должно быть двухсторонней очередью

source: value is not a valid dict
ru: значение должно быть словарём

source: value is not a valid float
ru: значение должно быть числом с плавающей запятой

source: value is not a valid frozenset
ru: значение должно быть неизменяемым множеством

source: value is not a valid hashable
ru: значение должно быть хэшируемым

source: value is not a valid integer
ru: значение должно быть целым числом

source: value is not a valid iterable
ru: значение должно быть итерируемым

source: JSON object must be str, bytes or bytearray
ru: JSON объект должен быть строкой, байтами или массивом байт

source: value is not a valid list
ru: значение должно быть списком

source: value is not none
ru: значение должно быть None

source: none is not an allowed value
ru: значение не должно быть None

source: value is not None
ru: значение должно быть None

source: value is not a valid path
ru: значение должно быть корректным путём

source: value is not a valid sequence
ru: значение должно быть последовательностью

source: value is not a valid set
ru: значение должно быть множеством

source: subclass of {expected_class} expected
ru: значение должно быть подклассом {expected_class}

source: value is not a valid tuple
ru: значение должно быть кортежем

source: value is not a valid uuid
ru: значение должно быть корректным UUID

source: ensure this value has at most {limit_value} characters
ru: значение должно содержать не больше {limit_value} символов

source: ensure this value has at least {limit_value} characters
ru: значение должно содержать как минимум {limit_value} символов

source: value is not a valid color: {reason}
ru: значение не является корректным цветом: {reason}

source: unexpected value; permitted: {permitted}
ru: неожиданное значение; ожидалось: {permitted}

source: date is not in the future
ru: указанная дата не в будущем

source: date is not in the past
ru: указанная дата не в прошлом

source: ensure that there are no more than {max_digits} digits in total
ru: в сумме должно быть не больше {max_digits} цифр

source: ensure this value has at most {limit_value} items
ru: значение должно содержать максимум {limit_value} элементов

source: ensure this value has at least {limit_value} items
ru: значение должно содержать как минимум {limit_value} элементов

source: the list has duplicated items
ru: список содержит совпадающие значения

source: field required
ru: поле обязательно

source: ensure this value is a finite number
ru: значение должно быть конечным числом

source: ensure this value is greater than or equal to {limit_value}
ru: значение должно быть больше или равно {limit_value}

source: ensure this value is greater than {limit_value}
ru: значение должно быть больше {limit_value}

source: ensure this value is less than or equal to {limit_value}
ru: значение должно быть меньше или равно {limit_value}

source: ensure this value is less than {limit_value}
ru: значение должно быть меньше {limit_value}

source: ensure this value is a multiple of {multiple_of}
ru: значение должно быть делиться на {multiple_of}

source: path "{path}" does not point to a directory
ru: путь "{path}" не указывает на директорию

source: path "{path}" does not point to a file
ru: путь "{path}" не указывает на файл

source: file or directory at path "{path}" does not exist
ru: файл или директория "{path}" не существует

source: card number is not all digits
ru: номер карты может содержать только цифры

source: Length for a {brand} card must be {required_length}
ru: длина для карты {brand} должна быть {required_length}

source: card number is not luhn valid
ru: контрольные цифры номера карты не совпадают

source: Invalid regular expression
ru: некорректное регулярное выражение

source: string does not match regex "{pattern}"
ru: строка не соответствует регулярному выражению "{pattern}"

source: wrong tuple length {actual_length}, expected {expected_length}
ru: некорректная длина кортежа {actual_length}, ожидалась длина {expected_length}

source: URL port invalid, port cannot exceed 65535
ru: некорретный URL порт, номер порта должен быть не больше 65535

source: invalid or missing URL scheme
ru: URL должен содержать корректную схему

source: uuid version {required_version} expected
ru: значение должно быть UUID версии {required_version}
